# TransactWithCentralOptions Properties

---
The TransactWithCentralOptions type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
TransactWithCentralOptions Class
Autodesk.Revit.DB Namespace